# Acquisition and Prep Excercises

## Exercises I

- Let's review the steps we take at the beginning of each new module.

1. Create a new repository named regression-exercises in your GitHub; all of your Regression work will be housed here.

# ✔️

2. Clone this repository within your local codeup-data-science directory.

# ✔️

3. Create a .gitignore and make sure your list of 'files to ignore' includes your env.py file.

# ✔️

4. Create a README.md file that outlines the contents and purpose of your repository.

# ✔️

5. Add, commit, and push these two files.

# ✔️

6. Now you can add your env.py file to this repository to access the Codeup database server.

# ✔️

7. For these exercises, you will create wrangle.ipynb and wrangle.py files to hold necessary functions.

# ✔️

8. As always, add, commit, and push your work often.

# ✔️

## Exercises II

- Let's set up an example scenario as perspective for our regression exercises using the Zillow dataset.

### As a Codeup data science graduate, you want to show off your skills to the Zillow data science team in hopes of getting an interview for a position you saw pop up on LinkedIn. You thought it might look impressive to build an end-to-end project in which you use some of their Kaggle data to predict property values using some of their available features; who knows, you might even do some feature engineering to blow them away. Your goal is to predict the values of single unit properties using the obervations from 2017.

- In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Zillow data from the zillow database in the Codeup database server.

### 1. Acquire *bedroomcnt*, *bathroomcnt*, *calculatedfinishedsquarefeet*, *taxvaluedollarcnt*, *yearbuilt*, *taxamount*, and *fips* from the *zillow* database for all 'Single Family Residential' properties.

- query used below

In [1]:
# SELECT 
#     bedroomcnt,
#     bathroomcnt,
#     calculatedfinishedsquarefeet,
#     taxvaluedollarcnt,
#     yearbuilt,
#     taxamount,
#     fips
# FROM 
#     properties
# WHERE 
#     propertylandusetypeid = 261; -- 'Single Family Residential'

### 2. Using your acquired Zillow data, walk through the summarization and cleaning steps in your *wrangle.ipynb* file like we did above. You may handle the missing values however you feel is appropriate and meaningful; remember to document your process and decisions using markdown and code commenting where helpful.

In [2]:
# imported libs

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from env import get_connection
import os

In [4]:
# created query to retrieve data sked for form the question

In [5]:
query = '''
        SELECT 
            bedroomcnt,
            bathroomcnt,
            calculatedfinishedsquarefeet,
            taxvaluedollarcnt,
            yearbuilt,
            taxamount,
            fips
        FROM 
            properties_2017
        WHERE 
            propertylandusetypeid = 261; -- 'Single Family Residential'
        '''

In [6]:
# using the instructor method of cleaning data;

# Going through data and identifying what correct datatypes should represent each 
# feature and scan each observation for any null or other values that make no sense.

In [7]:
url = get_connection('zillow')

In [8]:
df = pd.read_sql(query, url)

In [9]:
# Looking over the first 5 observations of the data; i have identified discrepancies

In [10]:
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [11]:
# Looking at the data types and any helpful information to aid in cleaning

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2152863 entries, 0 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
dtypes: float64(7)
memory usage: 115.0 MB

In [13]:
# quick look at stat summary

In [14]:
df.describe()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
count,2.152852e+06,2.152852e+06,2.144379e+06,2.152370e+06,2.143526e+06,2.148421e+06,2.152863e+06
mean,3.287196e+00,2.230688e+00,1.862855e+03,4.618962e+05,1.960950e+03,5.634866e+03,6.048377e+03
std,9.547544e-01,9.992796e-01,1.222125e+03,6.996760e+05,2.216220e+01,8.178910e+03,2.043329e+01
min,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.801000e+03,1.850000e+00,6.037000e+03
25%,3.000000e+00,2.000000e+00,1.257000e+03,1.881702e+05,1.949000e+03,2.534980e+03,6.037000e+03
50%,3.000000e+00,2.000000e+00,1.623000e+03,3.276710e+05,1.958000e+03,4.108950e+03,6.037000e+03
75%,4.000000e+00,3.000000e+00,2.208000e+03,5.345270e+05,1.976000e+03,6.414320e+03,6.059000e+03
max,2.500000e+01,3.200000e+01,9.525760e+05,9.842891e+07,2.016000e+03,1.337756e+06,6.111000e+03

In [15]:
# quick look at the shape of the dataset

In [16]:
df.shape

(2152863, 7)

In [17]:
# Checking for null vallues

In [18]:
df.isna().sum()

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [19]:
# Decided to drop all null values in the dataset

In [20]:
df = df.dropna()

In [21]:
# checked to see if there were still any nulls in the data

In [22]:
df.isna().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [23]:
# converted to integer from float point value because fips is a code number fore residential data

In [24]:
df.fips = df.fips.astype('int')
df.fips

4          6037
6          6037
7          6037
11         6037
14         6037
           ...
2152856    6037
2152858    6059
2152859    6059
2152861    6059
2152862    6037
Name: fips, Length: 2140235, dtype: int64

In [25]:
# year should be an int not a float.

In [26]:
df.yearbuilt = df.yearbuilt.astype('int')
df.yearbuilt

4          2005
6          2011
7          1926
11         1972
14         1973
           ...
2152856    2015
2152858    2015
2152859    2014
2152861    2015
2152862    2014
Name: yearbuilt, Length: 2140235, dtype: int64

In [27]:
# changed this feature to int since it did not have any fractional decimals in the values.

In [28]:
df.taxvaluedollarcnt = df.taxvaluedollarcnt.astype('int')
df.taxvaluedollarcnt

4          296425
6          847770
7          646760
11           5328
14           6920
            ...
2152856    422400
2152858    960756
2152859    536061
2152861    424353
2152862    554009
Name: taxvaluedollarcnt, Length: 2140235, dtype: int64

In [29]:
# I also changed square feet feature to an int; no decimal values after the ones place.

In [30]:
df.calculatedfinishedsquarefeet = df.calculatedfinishedsquarefeet.astype('int')
df.calculatedfinishedsquarefeet

4          3633
6          1620
7          2077
11         1200
14          171
           ...
2152856    4375
2152858    2262
2152859    3127
2152861    1974
2152862    2110
Name: calculatedfinishedsquarefeet, Length: 2140235, dtype: int64

In [31]:
# checked the first 5 columns and review observation ad feature cleanse. still needs work on the remaining features.

In [32]:
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,4.0,2.0,3633,296425,2005,6941.39,6037
6,3.0,4.0,1620,847770,2011,10244.94,6037
7,3.0,2.0,2077,646760,1926,7924.68,6037
11,0.0,0.0,1200,5328,1972,91.60,6037
14,0.0,0.0,171,6920,1973,255.17,6037

In [33]:
# checked for half bathrooms and full plus half bathrooms counts i removed all properties with 0.0 bathrooms
# it would not make sense for a single family residential properties with no bathroom.

In [34]:
df = df[df.bathroomcnt != 0.0]
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,4.0,2.0,3633,296425,2005,6941.39,6037
6,3.0,4.0,1620,847770,2011,10244.94,6037
7,3.0,2.0,2077,646760,1926,7924.68,6037
18,3.0,1.0,1244,169471,1950,2532.88,6037
19,3.0,2.0,1300,233266,1950,3110.99,6037

In [35]:
# filtered out properties with no bedrooms for single family residential properties.

In [36]:
df = df[df.bedroomcnt != 0.0]
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,4.0,2.0,3633,296425,2005,6941.39,6037
6,3.0,4.0,1620,847770,2011,10244.94,6037
7,3.0,2.0,2077,646760,1926,7924.68,6037
18,3.0,1.0,1244,169471,1950,2532.88,6037
19,3.0,2.0,1300,233266,1950,3110.99,6037

In [37]:
# after looking t the head() i left taxamount as float and moved on from there and looked at info to check the data

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2134909 entries, 4 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  int64
 3   taxvaluedollarcnt             int64
 4   yearbuilt                     int64
 5   taxamount                     float64
 6   fips                          int64
dtypes: float64(3), int64(4)
memory usage: 130.3 MB

In [39]:
df.shape

(2134909, 7)

In [40]:
df.describe()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
count,2.134909e+06,2.134909e+06,2.134909e+06,2.134909e+06,2.134909e+06,2.134909e+06,2.134909e+06
mean,3.308329e+00,2.245188e+00,1.864176e+03,4.608772e+05,1.960985e+03,5.619627e+03,6.048304e+03
std,9.211604e-01,9.858446e-01,1.162400e+03,6.746805e+05,2.213405e+01,7.784642e+03,2.032450e+01
min,1.000000e+00,5.000000e-01,1.000000e+00,2.200000e+01,1.801000e+03,1.648000e+01,6.037000e+03
25%,3.000000e+00,2.000000e+00,1.260000e+03,1.896280e+05,1.949000e+03,2.546700e+03,6.037000e+03
50%,3.000000e+00,2.000000e+00,1.624000e+03,3.288570e+05,1.958000e+03,4.116040e+03,6.037000e+03
75%,4.000000e+00,3.000000e+00,2.209000e+03,5.350000e+05,1.976000e+03,6.415760e+03,6.059000e+03
max,2.500000e+01,3.200000e+01,9.525760e+05,9.018846e+07,2.016000e+03,1.078102e+06,6.111000e+03

In [41]:
# decided to not plot and look at the distribution of the cleaned up data.

### 3. Store all of the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe with no missing values in your *wrangle.py* file. Name your final function *wrangle_zillow*.

In [42]:
# used example from lesson for the function in retrieving the zillow data.

In [43]:
def acquire_zillow():
    '''
    Read student_grades into a pandas DataFrame from mySQL,
    drop student_id column, replace whitespaces with NaN values,
    drop any rows with Null values, convert all columns to int64,
    return cleaned student grades DataFrame.
    '''

    # Acquire data

    filename = 'zillow_data_2017.csv'

    if os.path.isfile(filename):
        
        return pd.read_csv(filename)
        
    else: 

        query = '''
                SELECT 
                    bedroomcnt,
                    bathroomcnt,
                    calculatedfinishedsquarefeet,
                    taxvaluedollarcnt,
                    yearbuilt,
                    taxamount,
                    fips
                FROM 
                    properties_2017
                WHERE 
                    propertylandusetypeid = 261; -- 'Single Family Residential'
                '''

        url = get_connection('zillow')
                
        df = pd.read_sql(query, url)

        return df

In [44]:
# created celaning function of retrieved data.

In [45]:
def clean_zillow():
    
    df = acquire_zillow()
    
    # Drop rows with missing values in any column
    df = df.dropna()

    #rename cols
    df = df.rename(columns= {'bedroomcnt': 'bedrooms', 'bathroomcnt': 'bathrooms', 'calculatedfinishedsquarefeet' : 'area', 'taxvaluedollarcnt': 'tax_value', 'yearbuilt': 'year_built', 'taxamount': 'tax_amount'})

    # Convert selected columns to integer type
    int_columns = ['fips', 'year_built', 'tax_value', 'area', 'bedrooms']
    df[int_columns] = df[int_columns].astype(int)

    # Remove rows where bathroomcnt or bedroomcnt is 0.0
    # df = df[(df.bedrooms != 0.0) & (df.bathrooms != 0.0)]

    initial_df = {'county': ['LOS ANGELES', 'ORANGE', 'VENTURA'], 'fips' : [6037, 6059, 6111]}
    
    df1=pd.DataFrame(initial_df)
    
    df=df1.merge(df)
    
    # df.set_index(df['fips'], inplace=True)

    return df

In [46]:
df = clean_zillow()

# df.to_csv('zillow_data.csv',index=False)

In [47]:
df.head()

,county,fips,bedrooms,bathrooms,area,tax_value,year_built,tax_amount
0,LOS ANGELES,6037,4,2.0,3633,296425,2005,6941.39
1,LOS ANGELES,6037,3,4.0,1620,847770,2011,10244.94
2,LOS ANGELES,6037,3,2.0,2077,646760,1926,7924.68
3,LOS ANGELES,6037,0,0.0,1200,5328,1972,91.60
4,LOS ANGELES,6037,0,0.0,171,6920,1973,255.17

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2140235 entries, 0 to 2140234
Data columns (total 8 columns):
 #   Column      Dtype
---  ------      -----
 0   county      object
 1   fips        int64
 2   bedrooms    int64
 3   bathrooms   float64
 4   area        int64
 5   tax_value   int64
 6   year_built  int64
 7   tax_amount  float64
dtypes: float64(2), int64(5), object(1)
memory usage: 147.0+ MB

In [49]:
df.isnull().sum()

county        0
fips          0
bedrooms      0
bathrooms     0
area          0
tax_value     0
year_built    0
tax_amount    0
dtype: int64